{
  "metadata": {
    "title": "LUCID: Leveraging Unverified Claims Into Deliverables — A Neuroscience-Grounded Framework for Exploiting Large Language Model Hallucination as a Software Specification Engine",
    "upload_type": "publication",
    "publication_type": "preprint",
    "description": "<p>Large language model (LLM) hallucination is universally treated as a defect to be minimized. We argue this framing is backwards. Hallucination — the confident generation of plausible but unverified claims — is computationally identical to the brain's pattern completion mechanism that underlies both perception and imagination.</p><p>We present LUCID (Leveraging Unverified Claims Into Deliverables), a development methodology that deliberately invokes LLM hallucination, extracts the resulting claims as testable requirements, verifies them against a real codebase, and iteratively converges hallucinated fiction toward verified reality. By prompting an LLM to author Terms of Service for an application that does not yet exist, we exploit the model's confabulatory tendency to produce comprehensive, precise, multi-dimensional specifications — covering functionality, security, data privacy, performance, and legal compliance — in seconds.</p><p>We provide theoretical grounding through three convergent lines of evidence: (1) the mathematical equivalence between transformer attention and hippocampal pattern completion, (2) the predictive processing framework from cognitive neuroscience, and (3) the REBUS model of psychedelic hallucination. We demonstrate the framework on a real-world application, achieving convergence from 57.3% to 90.8% compliance across six iterations.</p><p>We position LUCID as the software engineering analogue of protein hallucination (Baker Lab, Nobel Prize 2024), where neural network 'dreams' serve as blueprints validated against physical reality. Formal impossibility results proving that hallucination cannot be eliminated from LLMs suggest that harnessing hallucination may be more productive than fighting it.</p><p>12 pages, 5 tables, 35 references. Open-source CLI implementation available.</p>",
    "creators": [
      {
        "name": "Wells, Ty",
        "affiliation": "Independent Researcher"
      }
    ],
    "keywords": [
      "LLM hallucination",
      "confabulation",
      "predictive processing",
      "specification generation",
      "requirements engineering",
      "iterative convergence",
      "neuroscience",
      "software engineering",
      "AI safety",
      "large language models"
    ],
    "license": "cc-by-4.0",
    "access_right": "open",
    "language": "eng",
    "version": "1.0",
    "publication_date": "2026-02-07",
    "notes": "Preprint. Open-source CLI implementation at https://github.com/gtsbahamas/hallucination-reversing-system",
    "related_identifiers": [
      {
        "identifier": "https://github.com/gtsbahamas/hallucination-reversing-system",
        "relation": "isSupplementedBy",
        "scheme": "url"
      }
    ],
    "subjects": [
      {
        "term": "Computer Science",
        "identifier": "http://id.loc.gov/authorities/subjects/sh89003285",
        "scheme": "url"
      }
    ]
  }
}
